tap "gotgenes/gotgenes"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "awscli@1", link: true
brew "bash-completion"
brew "bat"
brew "bower"
brew "cask"
brew "deno"
brew "docker"
brew "emacs", restart_service: true
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gotgenes/gotgenes/getignore" # gitignore patterns
brew "grunt-cli"
brew "jq"
brew "kubernetes-cli"
brew "lynx"
brew "mas"
brew "neovim"
brew "nginx"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk"
brew "pandoc"
brew "patchutils"
brew "pgcli"
brew "pkg-config"
brew "pyenv"
brew "postgresql@12"
brew "ranger"
brew "rbenv"
brew "ruby"
brew "redis"
brew "ripgrep"
brew "rustup"
brew "tmux"
brew "vlc"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "alfred"
cask "brave-browser"
cask "bartender"
cask "charles"
cask "daisydisk"
cask "discord"
cask "displaylink"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "notion"
cask "obsidian"
cask "postman"
cask "scroll-reverser"
cask "sequel-pro"
cask "slack"
cask "snagit"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"

# macOS App Store Apps
# Note that until Brewfile supports `mas purchase`, these must have been installed
# at least once before on the currently signed-in-on-the-macOS Apple ID.

# There are two ways to get the id of an app:
# `mas search [app name]` # Searches for app on App Store
# `mas list` # Lists all installed apps originating from App Store

mas "com.alice.mac.GetPlainText", id: 508368068 # Transform copied text to plain format.
mas "Drafts", id: 1435957248
mas "Flycut", id: 442160987                     # Clipboard manager for macOS - super useful.
mas "Moom", id: 419330170
mas "Reeder", id: 1449412482
mas "ScreenFloat", id: 414528154
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835

# Optional at this time

# mas 497799835 # "Xcode"


# Recommended But Cost Money:

# mas 415158530 # "PixelStick"
# mas 627866610 # "EPUB Viewer"
# mas 641027709 # "Color Picker"
# mas 499768540 # "Power JSON Editor"
# mas "Transmit", id: 403388562
# mas "Uninstaller Pro", id: 1153942223
# mas "World Clock Pro", id: 858446756


# Very Optional

# mas 406056744 # "Evernote"
# mas "Okta Extension App", id: 1439967473
# mas "Night Eye", id: 1450504903
