tap "gotgenes/gotgenes"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "awscli@1", link: true
brew "bash-completion"
brew "bat"
brew "bit"
brew "bower"
brew "cask"
brew "cmake"
brew "composer"
brew "deno"
brew "docker"
brew "emacs", restart_service: true
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gotgenes/gotgenes/getignore" # gitignore patterns
brew "grunt-cli"
brew "gulp"
brew "http-server"
brew "jq"
brew "k9s"
brew "kind"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "lynx"
brew "mariadb"
brew "mas"
brew "minikube"
brew "mkcert"
brew "neovim"
brew "nginx"
brew "nmap"
brew "node"
brew "nss"
brew "nvm"
brew "openjdk"
brew "pandoc"
brew "patchutils"
brew "pgcli"
brew "php"
brew "pipx"
brew "pkg-config"
brew "pv"
brew "pyenv"
brew "postgresql@12"
brew "ranger"
brew "rbenv"
brew "ruby"
brew "redis"
brew "ripgrep"
brew "rustup"
brew "terminal-notifier"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
cask "1password"
cask "alfred"
cask "anki"
cask "bartender"
cask "bettertouchtool"
cask "charles"
cask "daisydisk"
cask "discord"
cask "docker"
cask "firefox"
cask "figma"
cask "font-hack-nerd-font"
cask "gimp"
cask "google-chrome"
cask "hazel"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "logseq"
cask "notion"
cask "pixelsnap"
cask "postman"
cask "runjs"
cask "sequel-pro"
cask "signal"
cask "slack"
cask "smooze"
cask "snagit"
cask "soulver"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# macOS App Store Apps
# Note that until Brewfile supports `mas purchase`, these must have been installed
# at least once before on the currently signed-in-on-the-macOS Apple ID.

# There are two ways to get the id of an app:
# `mas search [app name]` # Searches for app on App Store
# `mas list` # Lists all installed apps originating from App Store

mas "com.alice.mac.GetPlainText", id: 508368068 # Transform copied text to plain format.
mas "Drafts", id: 1435957248
mas "Flycut", id: 442160987                     # Clipboard manager for macOS - super useful.
mas "Moom", id: 419330170
mas "Owly", id: 882812218
mas "QuickShade", id: 931571202
mas "Reeder", id: 1449412482
mas "ScreenFloat", id: 414528154
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "Tabs Switcher", id: 1406718335
mas "Things", id: 904280696
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "Smart JSON Editor", id: 1268962404
mas "HP Easy Scan", id: 967004861
mas "WireGuard", id: 1451685025

# Optional at this time

# mas 497799835 # "Xcode"


# Recommended But Cost Money:

# mas 415158530 # "PixelStick"
# mas 627866610 # "EPUB Viewer"
# mas 641027709 # "Color Picker"
# mas 499768540 # "Power JSON Editor"
# mas "Transmit", id: 403388562
# mas "Uninstaller Pro", id: 1153942223
# mas "World Clock Pro", id: 858446756


# Very Optional

# mas 406056744 # "Evernote"
# mas "Okta Extension App", id: 1439967473
# mas "Night Eye", id: 1450504903
